// 数据来源于百度知道，精度较差，见谅

var cities = [
  {
    "name": "广州市",
    "latlng": "113.264385,23.129112"
  },
  {
    "name": "合肥市",
    "latlng": "117.17,31.52"
  },
  {
    "name": "北京市",
    "latlng": "116.24,39.55"
  },
  {
    "name": "重庆市",
    "latlng": "106.54,29.59"
  },
  {
    "name": "福州市",
    "latlng": "119.18,26.05"
  },
  {
    "name": "兰州市",
    "latlng": "103.51,36.04"
  },
  {
    "name": "南宁市",
    "latlng": "108.19,22.48"
  },
  {
    "name": "贵阳市",
    "latlng": "106.42,26.35"
  },
  {
    "name": "海口市",
    "latlng": "110.20,20.02"
  },
  {
    "name": "石家庄市",
    "latlng": "114.30,38.02"
  },
  {
    "name": "郑州市",
    "latlng": "113.65,34.76"
  },
  {
    "name": "武汉市",
    "latlng": "114.17,30.35"
  },
  {
    "name": "长沙市",
    "latlng": "112.59,28.12"
  },
  {
    "name": "长春市",
    "latlng": "125.19,43.54"
  },
  {
    "name": "南京市",
    "latlng": "118.46,32.03"
  },
  {
    "name": "兰州市",
    "latlng": "103.51,36.04"
  },
  {
    "name": "南昌市",
    "latlng": "115.55,28.40"
  },
  {
    "name": "沈阳市",
    "latlng": "123.25,41.48"
  },
  {
    "name": "呼和浩特市",
    "latlng": "111.41,40.48"
  },
  {
    "name": "银川市",
    "latlng": "106.16,38.27"
  },
  {
    "name": "西宁市",
    "latlng": "101.48,36.38"
  },
  {
    "name": "济南市",
    "latlng": "117.00,36.40"
  },
  {
    "name": "太原市",
    "latlng": "112.33,37.54"
  },
  {
    "name": "西安市",
    "latlng": "108.57,34.17"
  },
  {
    "name": "上海市",
    "latlng": "121.29,31.14"
  },
  {
    "name": "成都市",
    "latlng": "104.04,30.40"
  },
  {
    "name": "天津市",
    "latlng": "117.12,39.02"
  },
  {
    "name": "拉萨市",
    "latlng": "91.08,29.39"
  },
  {
    "name": "乌鲁木齐市",
    "latlng": "87.36,43.45"
  },
  {
    "name": "昆明市",
    "latlng": "102.42,25.04"
  },
  {
    "name": "杭州市",
    "latlng": "120.10,30.16"
  },{
    "name": "哈尔滨",
    "latlng": "126.63, 45.75"
  },
  {
    "name": "香港",
    "latlng": "114.1,22.2"
  },
  {
    "name": "澳门",
    "latlng": "113.33,22.13"
  },
  {
    "name": "台北",
    "latlng": "121.5,25.05"
  }
]

module.exports = cities